In [2]:
import pandas as pd

In [3]:
s=pd.Series([1,2,3,4])
print(s)

0    1
1    2
2    3
3    4
dtype: int64

In [4]:
s1=pd.Series([2,3,6,5],index=["a","b","c","d"],dtype=float)
s1

a    2.0
b    3.0
c    6.0
d    5.0
dtype: float64

In [5]:
s2=pd.Series(0.5,index=[1,2,3,4,5])
s2

1    0.5
2    0.5
3    0.5
4    0.5
5    0.5
dtype: float64

.
.
.
.
.
.
.
.
2 CREATE A SERIES WITH HELP OF DICTONARY

In [6]:
s3 = pd.Series({"A":5,"B":6,"C":9})
s3

A    5
B    6
C    9
dtype: int64

..........3 DATA FRAMES

In [7]:
l = [1,2,3,6,5,4]
df = pd.DataFrame(l)
df

   0
0  1
1  2
2  3
3  6
4  5
5  4

In [8]:
l1 = [[1,2,3,4] , [5,6,7,2,8],[1,5,9,6,4,4]]
df = pd.DataFrame({"A":l1,"B":l1,"C":l1,"D":l1})
print(df)

                    A                   B                   C  \
0        [1, 2, 3, 4]        [1, 2, 3, 4]        [1, 2, 3, 4]
1     [5, 6, 7, 2, 8]     [5, 6, 7, 2, 8]     [5, 6, 7, 2, 8]
2  [1, 5, 9, 6, 4, 4]  [1, 5, 9, 6, 4, 4]  [1, 5, 9, 6, 4, 4]

                    D
0        [1, 2, 3, 4]
1     [5, 6, 7, 2, 8]
2  [1, 5, 9, 6, 4, 4]

In [9]:
df=pd.DataFrame({"A":[1,2,2] , "B":[4,"?",9],"C":[5,4,8]})
df

   A  B  C
0  1  4  5
1  2  ?  4
2  2  9  8

In [10]:
l=({"A":1 , "B":2} , {"A":4 , "B":6})
df1=pd.DataFrame(l)
df1

   A  B
0  1  2
1  4  6

In [11]:
l=({"A":1 , "B":3} , {"A":5 , "B":6})
df2=pd.DataFrame(l)
df2

   A  B
0  1  3
1  5  6

In [12]:
pd.merge(df1,df2)

Empty DataFrame
Columns: [A, B]
Index: []

In [13]:
l=({"A":1 , "B":3} , { "B":6})
df3=pd.DataFrame(l)
df3

     A  B
0  1.0  3
1  NaN  6

. . . . . . . . . . . . . 4 READ A DATA IN PANDAS

In [16]:
data = pd.read_csv("car data.csv")
# data.head()
data.head()

,Car_Name,Year,Selling_Price,Present_Price,Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner
0,ritz,2014,3.35,5.59,27000,Petrol,Dealer,Manual,0
1,sx4,2013,4.75,9.54,43000,Diesel,Dealer,Manual,0
2,ciaz,2017,7.25,9.85,6900,Petrol,Dealer,Manual,0
3,wagon r,2011,2.85,4.15,5200,Petrol,Dealer,Manual,0
4,swift,2014,4.60,6.87,42450,Diesel,Dealer,Manual,0

In [38]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 301 entries, 0 to 300
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Car_Name       301 non-null    object
 1   Year           301 non-null    int64
 2   Selling_Price  301 non-null    float64
 3   Present_Price  301 non-null    float64
 4   Kms_Driven     301 non-null    int64
 5   Fuel_Type      301 non-null    object
 6   Seller_Type    301 non-null    object
 7   Transmission   301 non-null    object
 8   Owner          301 non-null    int64
dtypes: float64(2), int64(3), object(4)
memory usage: 21.3+ KB

In [67]:
data.describe()

              Year  Selling_Price  Present_Price     Kms_Driven       Owner
count   301.000000     301.000000     301.000000     301.000000  301.000000
mean   2013.627907       4.661296       7.628472   36947.205980    0.043189
std       2.891554       5.082812       8.644115   38886.883882    0.247915
min    2003.000000       0.100000       0.320000     500.000000    0.000000
25%    2012.000000       0.900000       1.200000   15000.000000    0.000000
50%    2014.000000       3.600000       6.400000   32000.000000    0.000000
75%    2016.000000       6.000000       9.900000   48767.000000    0.000000
max    2018.000000      35.000000      92.600000  500000.000000    3.000000

In [40]:
data.isnull().head()

,Car_Name,Year,Selling_Price,Present_Price,Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner
0,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False

In [41]:
data.isnull().sum()

Car_Name         0
Year             0
Selling_Price    0
Present_Price    0
Kms_Driven       0
Fuel_Type        0
Seller_Type      0
Transmission     0
Owner            0
dtype: int64

In [43]:
data.nunique() #To find a unique value on patricular columns

Car_Name          98
Year              16
Selling_Price    156
Present_Price    147
Kms_Driven       206
Fuel_Type          3
Seller_Type        2
Transmission       2
Owner              3
dtype: int64

In [47]:
data["Car_Name"].nunique

<bound method IndexOpsMixin.nunique of 0         ritz
1          sx4
2         ciaz
3      wagon r
4        swift
        ...
296       city
297       brio
298       city
299       city
300       brio
Name: Car_Name, Length: 301, dtype: object>

In [51]:
#Count a unique values on
data["Car_Name"].value_counts().head(50)

Car_Name
city                         26
corolla altis                16
verna                        14
fortuner                     11
brio                         10
ciaz                          9
innova                        9
i20                           9
grand i10                     8
jazz                          7
amaze                         7
Royal Enfield Classic 350     7
ertiga                        6
eon                           6
sx4                           6
alto k10                      5
i10                           5
swift                         5
Bajaj Pulsar 150              4
Royal Enfield Thunder 350     4
ritz                          4
wagon r                       4
etios liva                    4
dzire                         4
xcent                         3
etios cross                   3
Royal Enfield Thunder 500     3
TVS Apache RTR 160            3
Yamaha FZ S V 2.0             3
creta                         3
Honda CB Hornet 160R          3
etios g                       3
Bajaj Avenger 220             3
Bajaj Pulsar NS 200           3
Bajaj Discover 125            2
Bajaj Pulsar 220 F            2
TVS Apache RTR 180            2
Yamaha FZ  v 2.0              2
Honda Activa 4G               2
Hero Extreme                  2
Honda CB twister              2
Hero Splender iSmart          2
Activa 3g                     2
Hero Passion Pro              2
Honda CB Shine                2
Bajaj Avenger 220 dtsi        2
Honda CBR 150                 2
elantra                       2
Royal Enfield Classic 500     2
KTM RC200                     2
Name: count, dtype: int64

...................6 Rename a Column

In [52]:
data = pd.read_csv("car data.csv")
data.head()

,Car_Name,Year,Selling_Price,Present_Price,Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner
0,ritz,2014,3.35,5.59,27000,Petrol,Dealer,Manual,0
1,sx4,2013,4.75,9.54,43000,Diesel,Dealer,Manual,0
2,ciaz,2017,7.25,9.85,6900,Petrol,Dealer,Manual,0
3,wagon r,2011,2.85,4.15,5200,Petrol,Dealer,Manual,0
4,swift,2014,4.60,6.87,42450,Diesel,Dealer,Manual,0

In [60]:
data.rename(columns={"Car_Name":"CarName" , "Selling_price":"SP"}).head()

,CarName,Year,Selling_Price,Present_Price,Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner
0,ritz,2014,3.35,5.59,27000,Petrol,Dealer,Manual,0
1,sx4,2013,4.75,9.54,43000,Diesel,Dealer,Manual,0
2,ciaz,2017,7.25,9.85,6900,Petrol,Dealer,Manual,0
3,wagon r,2011,2.85,4.15,5200,Petrol,Dealer,Manual,0
4,swift,2014,4.60,6.87,42450,Diesel,Dealer,Manual,0

 7 find a mean,sum,min,max,count,std,var

In [61]:
data["Kms_Driven"].mean()

36947.20598006644

In [68]:
data["Kms_Driven"].max()

500000

In [69]:
data["Kms_Driven"].min()

500

In [70]:
data["Kms_Driven"].sum()

11121109

In [71]:
data["Kms_Driven"].count()

301

In [72]:
data["Kms_Driven"].std()

38886.88388206788

In [73]:
data["Kms_Driven"].var()

1512189738.0574307

8 Some Filltering Opertaions

In [74]:
data.head()

,Car_Name,Year,Selling_Price,Present_Price,Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner
0,ritz,2014,3.35,5.59,27000,Petrol,Dealer,Manual,0
1,sx4,2013,4.75,9.54,43000,Diesel,Dealer,Manual,0
2,ciaz,2017,7.25,9.85,6900,Petrol,Dealer,Manual,0
3,wagon r,2011,2.85,4.15,5200,Petrol,Dealer,Manual,0
4,swift,2014,4.60,6.87,42450,Diesel,Dealer,Manual,0

In [75]:
data.tail()

,Car_Name,Year,Selling_Price,Present_Price,Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner
296,city,2016,9.50,11.6,33988,Diesel,Dealer,Manual,0
297,brio,2015,4.00,5.9,60000,Petrol,Dealer,Manual,0
298,city,2009,3.35,11.0,87934,Petrol,Dealer,Manual,0
299,city,2017,11.50,12.5,9000,Diesel,Dealer,Manual,0
300,brio,2016,5.30,5.9,5464,Petrol,Dealer,Manual,0

 9 Howto cahange a data type of columns

In [77]:
data=pd.read_csv("car data.csv",dtype={"Year":float})
data.head()

,Car_Name,Year,Selling_Price,Present_Price,Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner
0,ritz,2014.0,3.35,5.59,27000,Petrol,Dealer,Manual,0
1,sx4,2013.0,4.75,9.54,43000,Diesel,Dealer,Manual,0
2,ciaz,2017.0,7.25,9.85,6900,Petrol,Dealer,Manual,0
3,wagon r,2011.0,2.85,4.15,5200,Petrol,Dealer,Manual,0
4,swift,2014.0,4.60,6.87,42450,Diesel,Dealer,Manual,0

In [78]:
data.fillna

<bound method NDFrame.fillna of     Car_Name    Year  Selling_Price  Present_Price  Kms_Driven Fuel_Type  \
0       ritz  2014.0           3.35           5.59       27000    Petrol
1        sx4  2013.0           4.75           9.54       43000    Diesel
2       ciaz  2017.0           7.25           9.85        6900    Petrol
3    wagon r  2011.0           2.85           4.15        5200    Petrol
4      swift  2014.0           4.60           6.87       42450    Diesel
..       ...     ...            ...            ...         ...       ...
296     city  2016.0           9.50          11.60       33988    Diesel
297     brio  2015.0           4.00           5.90       60000    Petrol
298     city  2009.0           3.35          11.00       87934    Petrol
299     city  2017.0          11.50          12.50        9000    Diesel
300     brio  2016.0           5.30           5.90        5464    Petrol

    Seller_Type Transmission  Owner
0        Dealer       Manual      0
1        Dealer       Manual      0
2        Dealer       Manual      0
3        Dealer       Manual      0
4        Dealer       Manual      0
..          ...          ...    ...
296      Dealer       Manual      0
297      Dealer       Manual      0
298      Dealer       Manual      0
299      Dealer       Manual      0
300      Dealer       Manual      0

[301 rows x 9 columns]>

# How to replace a row value

In [79]:
data.head(2)

,Car_Name,Year,Selling_Price,Present_Price,Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner
0,ritz,2014.0,3.35,5.59,27000,Petrol,Dealer,Manual,0
1,sx4,2013.0,4.75,9.54,43000,Diesel,Dealer,Manual,0

In [80]:
data.replace("Manual","NotManual").head()

,Car_Name,Year,Selling_Price,Present_Price,Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner
0,ritz,2014.0,3.35,5.59,27000,Petrol,Dealer,NotManual,0
1,sx4,2013.0,4.75,9.54,43000,Diesel,Dealer,NotManual,0
2,ciaz,2017.0,7.25,9.85,6900,Petrol,Dealer,NotManual,0
3,wagon r,2011.0,2.85,4.15,5200,Petrol,Dealer,NotManual,0
4,swift,2014.0,4.60,6.87,42450,Diesel,Dealer,NotManual,0

In [81]:
data.replace(3.35,55).head()

,Car_Name,Year,Selling_Price,Present_Price,Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner
0,ritz,2014.0,55.00,5.59,27000,Petrol,Dealer,Manual,0
1,sx4,2013.0,4.75,9.54,43000,Diesel,Dealer,Manual,0
2,ciaz,2017.0,7.25,9.85,6900,Petrol,Dealer,Manual,0
3,wagon r,2011.0,2.85,4.15,5200,Petrol,Dealer,Manual,0
4,swift,2014.0,4.60,6.87,42450,Diesel,Dealer,Manual,0

In [83]:
data.replace([4.75,9.54,43000],8).head()

,Car_Name,Year,Selling_Price,Present_Price,Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner
0,ritz,2014.0,3.35,5.59,27000,Petrol,Dealer,Manual,0
1,sx4,2013.0,8.00,8.00,8,Diesel,Dealer,Manual,0
2,ciaz,2017.0,7.25,9.85,6900,Petrol,Dealer,Manual,0
3,wagon r,2011.0,2.85,4.15,5200,Petrol,Dealer,Manual,0
4,swift,2014.0,4.60,6.87,42450,Diesel,Dealer,Manual,0

 11 how to check paticular rows

In [84]:
data.loc[[0,5]]

,Car_Name,Year,Selling_Price,Present_Price,Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner
0,ritz,2014.0,3.35,5.59,27000,Petrol,Dealer,Manual,0
5,vitara brezza,2018.0,9.25,9.83,2071,Diesel,Dealer,Manual,0

In [85]:
data.loc[[10,15]]

,Car_Name,Year,Selling_Price,Present_Price,Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner
10,alto 800,2017.0,2.85,3.60,2135,Petrol,Dealer,Manual,0
15,ertiga,2016.0,7.75,10.79,43000,Diesel,Dealer,Manual,0

In [89]:
data.iloc[1,3]

9.54

In [90]:
data.isnull().sum()

Car_Name         0
Year             0
Selling_Price    0
Present_Price    0
Kms_Driven       0
Fuel_Type        0
Seller_Type      0
Transmission     0
Owner            0
dtype: int64

# 12 To Find a values on particular columns

In [97]:
data.groupby("Car_Name").get_group("ritz")

,Car_Name,Year,Selling_Price,Present_Price,Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner
0,ritz,2014.0,3.35,5.59,27000,Petrol,Dealer,Manual,0
30,ritz,2012.0,3.10,5.98,51439,Diesel,Dealer,Manual,0
31,ritz,2011.0,2.35,4.89,54200,Petrol,Dealer,Manual,0
46,ritz,2013.0,2.65,4.89,64532,Petrol,Dealer,Manual,0

In [99]:
dff=data.groupby("Fuel_Type").get_group("Petrol")
dff.head()

,Car_Name,Year,Selling_Price,Present_Price,Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner
0,ritz,2014.0,3.35,5.59,27000,Petrol,Dealer,Manual,0
2,ciaz,2017.0,7.25,9.85,6900,Petrol,Dealer,Manual,0
3,wagon r,2011.0,2.85,4.15,5200,Petrol,Dealer,Manual,0
6,ciaz,2015.0,6.75,8.12,18796,Petrol,Dealer,Manual,0
10,alto 800,2017.0,2.85,3.60,2135,Petrol,Dealer,Manual,0

# comparsion

In [102]:
data[(data["Selling_Price"] == 6.75) & (data["Kms_Driven"]==18796)]

,Car_Name,Year,Selling_Price,Present_Price,Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner
6,ciaz,2015.0,6.75,8.12,18796,Petrol,Dealer,Manual,0

In [103]:
data[(data["Selling_Price"] == 6.75) | (data["Kms_Driven"]==18796)]

,Car_Name,Year,Selling_Price,Present_Price,Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner
6,ciaz,2015.0,6.75,8.12,18796,Petrol,Dealer,Manual,0